controltheory/beamer/6/6_1_corrector.org
# +LaTeX_CLASS:  article
#+LATEX_HEADER: \usepackage{etex}
#+LATEX_HEADER: \usepackage{amsmath}
 # +LATEX_HEADER: \usepackage[usenames]{color}
#+LATEX_HEADER: \usepackage{pstricks}
#+LATEX_HEADER: \usepackage{pgfplots}
#+LATEX_HEADER: \pgfplotsset{compat=1.8}
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usepackage[europeanresistors,americaninductors]{circuitikz}
#+LATEX_HEADER: \usepackage{colortbl}
#+LATEX_HEADER: \usepackage{yfonts}
#+LATEX_HEADER: \usetikzlibrary{shapes,arrows}
#+LATEX_HEADER: \usetikzlibrary{positioning}
#+LATEX_HEADER: \usetikzlibrary{arrows,shapes}
#+LATEX_HEADER: \usetikzlibrary{intersections}
#+LATEX_HEADER: \usetikzlibrary{calc,patterns,decorations.pathmorphing,decorations.markings}
#+LATEX_HEADER: \usepackage[BoldFont,SlantFont,CJKchecksingle]{xeCJK}
#+LATEX_HEADER: \setCJKmainfont[BoldFont=Evermore Hei]{Evermore Kai}
#+LATEX_HEADER: \setCJKmonofont{Evermore Kai}
 # +LATEX_HEADER: \xeCJKsetup{CJKglue=\hspace{0pt plus .08 \baselineskip }}
#+LATEX_HEADER: \usepackage{pst-node}
#+LATEX_HEADER: \usepackage{pst-plot}
#+LATEX_HEADER: \psset{unit=5mm}


#+startup: beamer
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [table]
# +LaTeX_CLASS_OPTIONS: [bigger]
 # +latex_header:  \mode<article>{\usepackage{beamerarticle}}
# +latex_header: \mode<beamer>{\usetheme{JuanLesPins}}
# +latex_header: \mode<beamer>{\usetheme{Boadilla}}
#+latex_header: \mode<beamer>{\usetheme{Frankfurt}}
#+latex_header: \mode<beamer>{\usecolortheme{dove}}
#+latex_header: \mode<article>{\hypersetup{colorlinks=true,pdfborder={0 0 0}}}
#+latex_header: \mode<beamer>{\AtBeginSection[]{\begin{frame}<beamer>\frametitle{Topic}\tableofcontents[currentsection]\end{frame}}}
#+latex_header: \setbeamercovered{transparent}
#+BEAMER_FRAME_LEVEL: 2
#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)

#+TITLE:  线性系统校正方法
#+latex_header: \subtitle{系统设计与校正}
#+AUTHOR:    
#+EMAIL: 
#+DATE:  
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:









* 校正装置的目的
** 校正装置的目的
\begin{tikzpicture}[node distance=2em,auto,>=latex', thick]
% \path[use as bounding box] (-1,0) rectangle (10,-2); 
\path[->] node[] (r) {$R(s)$}; 
\path[->] node[ circle,inner sep=2pt,minimum size=1pt,draw,label=below left:$   $ ,right =of r] (p1) {}; 
\path[->](r) edge node {} (p1) ; 
\path[blue,->] node[draw, right =of p1] (gc) {$G_{c}(s)$}; 
\path[blue,->] node[draw, above =of gc] (gr) {$G_{r}(s)$}; 
\path[->] (p1) edge node {} (gc) ; 
\path[ draw] (r.east)+(1em,0)  |-  (gr); 
\path[->] node[ circle,inner sep=2pt,minimum size=1pt,draw,label=below left:$   $ ,right =of gc] (p2) {}; 
\path[->] (gc) edge node {} (p2) ; 
\path[->,draw] (gr) -| (p2) ; 
\path[red,->] node[draw, inner sep=5pt,right =of p2] (g) {$G(s)$}; 
\path[->] (p2) edge node {} (g); 
\path[->] node[ right =of g] (o) {$C(s)$}; 
\path[->] (g) edge node {} (o); 
\path[blue,->] node[draw, inner sep=5pt,below =of g] (gf) {$G_f(s)$}; 
\path[ draw] (g.east)+(1em,0)  |-  (gf); 
\path[->, draw] (gf.west) -| node[very near end] {$-$} (p2); 
\path[->, draw] (g.east)+(1em,0) -- +(1em,-7em) -| node[very near end] {$-$} (p1); 
\end{tikzpicture} 

 * <2->改善系统稳定性
 * <2->改善系统的稳态性能
 * <2->改善系统的动态品质

* 设计指标的转换
** 设计指标的转换
 * <2->二阶系统的时域与频域指标有明确的转换公式
 * <3->高阶系统的时域与频域指标有近似转换公式
 * <4->校正后系统的要求
     * <4->低频段:积分环节, $K$ 尽量大,以减小稳态误差
     * <5->中频段:以斜率 $-20dB/dec$ 穿越 $0dB$ 线,使 $\omega_c$ 足够大,提高动态性能
     * <6->高频段:抗干扰要求,增益下降要快

